Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: I.e., ``REG_ID`` is available as ``LV_EVE_REG_ID`` and ``EVE_ROM_CHIPID`` is available as ``LV_EVE_EVE_ROM_CHIPID``, etc.
it_it: Ad esempio, ``REG_ID`` è disponibile come ``LV_EVE_REG_ID`` e ``EVE_ROM_CHIPID`` è disponibile come ``LV_EVE_EVE_ROM_CHIPID``, ecc.

source: I1, I2, I4 and I8 indexed formats require ``LV_DRAW_SW_SUPPORT_ARGB8888`` to be configured to ``1`` in your ``lv_conf.h`` file.
it_it: I formati indicizzati I1, I2, I4 e I8 richiedono che ``LV_DRAW_SW_SUPPORT_ARGB8888`` sia configurato su ``1`` nel file ``lv_conf.h``.

source: IBL (Image-Based Lighting) uses 360° panoramic images to light and shade 3D models, creating realistic reflections and environmental effects.
it_it: IBL (Image-Based Lighting) utilizza immagini panoramiche a 360° per illuminare e ombreggiare modelli 3D, creando riflessi ed effetti ambientali realistici.

source: ICOP is one such platform.
it_it: ICOP è una di queste piattaforme.

source: ICOP makes industrial computer hardware and the development tools for them.
it_it: ICOP produce hardware per computer industriali e relativi strumenti di sviluppo.

source: ICOP offers an uncommon combination of hardware and software which distinguishes them from other board vendors.
it_it: ICOP offre una combinazione insolita di hardware e software che la distingue dagli altri fornitori di schede.

source: IDE Support
it_it: Supporto IDE

source: IDF Setup
it_it: Configurazione IDF

source: IDF4.4 or higher
it_it: IDF4.4 o superiore

source: IF the value was not 0, it will be 0.
it_it: Se il valore non era 0, sarà 0

source: ILI9341 supports parallel 8-/9-/16-/18-bit data bus MCU interface, 6-/16-/18-bit data bus RGB interface and 3-/4-line serial peripheral interface(SPI).
it_it: ILI9341 supporta l'interfaccia MCU parallela con bus dati a 8/9/16/18 bit, l'interfaccia RGB con bus dati a 6/16/18 bit e l'interfaccia periferica seriale (SPI) a 3/4 linee.

source: Ideal for use in microprocessors.
it_it: Ideale per l'uso nei microprocessori.

source: Identifier Letters
it_it: Lettere Identificative

source: Identify The Problem
it_it: Identificare Il Problema

source: Identify your board variant in the list and set ``BOARD_ALIF_DEVKIT_VARIANT`` to the correct value.
it_it: Identificare la variante della scheda nell'elenco e impostare ``BOARD_ALIF_DEVKIT_VARIANT`` sul valore corretto.

source: If *open* didn't fully open an image this function should decode the indicated area of the image into the draw buffer.
it_it: Se *open* non ha aperto completamente un'immagine, questa funzione dovrebbe decodificare l'area indicata dell'immagine nel "draw buffer".

source: If :c:macro:`LV_BUILD_TEST` equates to a non-zero value and you are including LVGL test code in your compile (or if you otherwise simply need to use them), you will also need to provide an implementation for:
it_it: Se :c:macro:`LV_BUILD_TEST` equivale a un valore diverso da zero e si include codice di test LVGL nella compilazione (o se semplicemente c'è bisogno di utilizzarle), sarà necessario fornire anche un'implementazione per:

source: If :c:macro:`LV_CONF_SKIP` is defined, LVGL will not try to include ``lv_conf.h``.
it_it: Se :c:macro:`LV_CONF_SKIP` è definito, LVGL non tenterà di includere ``lv_conf.h``.

source: If :c:macro:`LV_LABEL_TEXT_SELECTION` is set to a non-zero value in ``lv_conf.h``, some additional functionality (and 8 bytes per label) are added to Label Widgets and Text Area Widgets, and text-selection functionality is automated in Text Area Widgets.
it_it: Se :c:macro:`LV_LABEL_TEXT_SELECTION` è impostato su un valore diverso da zero in ``lv_conf.h``, alcune funzionalità aggiuntive (e 8 byte per etichetta) vengono aggiunte ai Widget Label e ai Widget Text Area, e la funzionalità di selezione del testo viene automatizzata nei Widget Text Area.

source: If :c:macro:`LV_OBJ_ID_AUTO_ASSIGN` equates to a non-zero value (or if you otherwise simply need to use them), you will also need to provide implementations for:
it_it: Se :c:macro:`LV_OBJ_ID_AUTO_ASSIGN` equivale a un valore diverso da zero (o se semplicemente c'è bisogno di utilizzarle), sarà necessario fornire anche le implementazioni per:

source: If :c:macro:`LV_OBJ_ID_AUTO_ASSIGN` equates to a non-zero value, :cpp:func:`lv_obj_assign_id` is called when a Widget is created.
it_it: Se :c:macro:`LV_OBJ_ID_AUTO_ASSIGN` equivale a un valore diverso da zero, :cpp:func:`lv_obj_assign_id` viene chiamato quando viene creato un Widget.

source: If :c:macro:`LV_OBJ_ID_AUTO_ASSIGN` equates to a non-zero value, :cpp:func:`lv_obj_free_id` is called when a Widget is deleted.
it_it: Se :c:macro:`LV_OBJ_ID_AUTO_ASSIGN` equivale a un valore diverso da zero, :cpp:func:`lv_obj_free_id` viene chiamato quando un Widget viene eliminato.

source: If :c:macro:`LV_USE_DRAW_SW` is set to ``1`` in ``lv_conf.h`` (it is by default), the Software Drawing Unit enters itself at the head of that list.
it_it: Se :c:macro:`LV_USE_DRAW_SW` è impostato a ``1`` in ``lv_conf.h`` (il default), la Drawing Unit Software si inserisce in cima a tale elenco.

source: If :c:macro:`SDK_OS_FREE_RTOS` symbol is defined, FreeRTOS implementation will be used, otherwise bare metal code will be included.
it_it: Se è definito il simbolo :c:macro:`SDK_OS_FREE_RTOS`, verrà utilizzata l'implementazione di FreeRTOS, altrimenti verrà incluso codice "bare-metal".

source: If :cpp:enumerator:`LV_OBJ_FLAG_ADV_HITTEST` is enabled the Arc will be sensitive only in the range between start and end background angles and on the Arc itself (not inside the Arc).
it_it: Se :cpp:enumerator:`LV_OBJ_FLAG_ADV_HITTEST` è abilitato, l'Arco sarà sensibile solo nell'intervallo tra gli angoli di sfondo iniziale e finale e sull'Arco stesso (non all'interno dell'Arco).

source: If :cpp:expr:`lv_anim_set_repeat_count(&anim_template, cnt)` has been called passing :c:macro:`LV_ANIM_REPEAT_INFINITE`, the animation never reaches a state of being "completed".
it_it: Se :cpp:expr:`lv_anim_set_repeat_count(&anim_template, cnt)` è stata chiamata passando :c:macro:`LV_ANIM_REPEAT_INFINITE`, l'animazione non raggiunge mai lo stato di "completamento".

source: If :cpp:expr:`lv_obj_add_flag(widget, LV_OBJ_FLAG_EVENT_BUBBLE)` is enabled all events will be sent to a Widget's parent as well.
it_it: Se :cpp:expr:`lv_obj_add_flag(widget, LV_OBJ_FLAG_EVENT_BUBBLE)` è abilitato, tutti gli eventi verranno inviati anche al Widget padre.

source: If :cpp:expr:`lv_textarea_set_cursor_click_pos(textarea, true)` is applied, the cursor will jump to the position where the Text Area was clicked.
it_it: Se si applica :cpp:expr:`lv_textarea_set_cursor_click_pos(textarea, true)`, il cursore salterà nella posizione in cui è stato cliccato sull'area di testo.

source: If :cpp:func:`lv_tick_inc` is called from an ISR, it should be from either a high priority interrupt or an interrupt that cannot be missed when the system is under high load.
it_it: Se :cpp:func:`lv_tick_inc` viene chiamato da un ISR, dovrebbe provenire da un interrupt ad alta priorità o da un interrupt che non può essere perso quando il sistema è sotto carico elevato.

source: If GPU is busy, the task will be queued, and the VGLite dispatcher will ask for a new available task.
it_it: Se la GPU è occupata, l'attività verrà messa in coda e il dispatcher VGLite richiederà una nuova attività disponibile.

source: If GPU is idle, the queue with any pending tasks will be flushed to the GPU.
it_it: Se la GPU è inattiva, la coda con eventuali attività in sospeso verrà scaricata sulla GPU.

source: If KConfig is used, this is enabled automatically.
it_it: Se si utilizza KConfig, questa opzione viene abilitata automaticamente.

source: If NULL is passed as the ``format_string`` argument when subscribing, the Subject's pointer value is assumed to point to a NUL-terminated string and is used to directly update the Label's text.
it_it: Se durante la sottoscrizione viene passato NULL come argomento ``format_string``, si presume che il valore del puntatore del Subject punti a una stringa terminata da NULL e viene utilizzato per aggiornare direttamente il testo dell'etichetta.

source: If NULL is passed instead of a pointer to a "root" Widget, the dump will include the Widget Tree for all :ref:`Screens`, for all :ref:`Displays <display>` in the system.
it_it: Se viene passato NULL invece di un puntatore a un Widget "root", il dump includerà il Widget Tree per tutti gli :ref:`Screens`, per tutti i :ref:`Display <display>` nel sistema.

source: If OS is enabled, a synchronization primitive will be used to give the thread a chance to yield to other threads while blocked, improving CPU utilization.
it_it: Se il sistema operativo è abilitato, verrà utilizzata una primitiva di sincronizzazione per dare al thread la possibilità di cedere il passo ad altri thread mentre è bloccato, migliorando l'utilizzo della CPU.

source: If Widget does NOT need to be deleted:
it_it: Se il Widget NON deve essere eliminato:

source: If Widget needs to be deleted, simply delete the Widget, which will automatically gracefully remove the Observer (and its events) from the Subject, while deleting the Widget.
it_it: Se è necessario eliminare un Widget, è sufficiente farlo, il che rimuoverà automaticamente e correttamente l'Observer (e i suoi eventi) dal Subject, eliminando al contempo il Widget.

source: If `LV_USE_G2D_DRAW_THREAD` is not defined, then no additional draw thread will be created and the G2D drawing task will get executed on the same LVGL main thread.
it_it: Se `LV_USE_G2D_DRAW_THREAD` non è definito, non verrà creato alcun thread di disegno aggiuntivo e l'attività di disegno G2D verrà eseguita sullo stesso thread principale LVGL.

source: If `LV_USE_PXP_DRAW_THREAD` is not defined, then no additional draw thread will be created and the PXP drawing task will get executed on the same LVGL main thread.
it_it: Se `LV_USE_PXP_DRAW_THREAD` non è definito, non verrà creato alcun thread di disegno aggiuntivo e il task di disegno PXP verrà eseguito sullo stesso thread principale LVGL.

source: If `LV_USE_VGLITE_DRAW_THREAD` is not defined, then no additional draw thread will be created and the VGLite drawing task will get executed on the same LVGL main thread.
it_it: Se `LV_USE_VGLITE_DRAW_THREAD` non è definito, non verrà creato alcun thread di disegno aggiuntivo e l'attività di disegno di VGLite verrà eseguita sullo stesso thread principale di LVGL.

source: If ``-1`` is passed, the DRM driver will try to automatically pick the first available connector.
it_it: Se viene passato ``-1``, il driver DRM tenterà di selezionare automaticamente il primo connettore disponibile.

source: If ``<include_timeline>``\ s are also used, the requested timeline is included in the Component's timeline at this point too.
it_it: Se vengono utilizzati anche ``<include_timeline>``, la timeline richiesta viene inclusa anche nella timeline del Componente.

source: If ``<param>``\ s are used, they are passed to the same ``set`` function.
it_it: Se vengono utilizzati ``<param>``, vengono passati alla stessa funzione ``set``.

source: If ``LV_USE_LZ4_EXTERNAL`` is enabled, the LVGL project is assumed to be compiled and linked with an external LZ4 library that provides the :cpp:func:`LZ4_decompress_safe` function.
it_it: Se ``LV_USE_LZ4_EXTERNAL`` è abilitato, si presume che il progetto LVGL sia compilato e linkato a una libreria LZ4 esterna che fornisce la funzione :cpp:func:`LZ4_decompress_safe`.

source: If ``LV_USE_LZ4_INTERNAL`` is enabled in ``lv_conf.h``, LVGL's internal copy of the LZ4 decompression algorithm is used (``./src/libs/lz4/lz4.c``).
it_it: Se ``LV_USE_LZ4_INTERNAL`` è abilitato in ``lv_conf.h``, viene utilizzata la copia interna di LVGL dell'algoritmo di decompressione LZ4 (``./src/libs/lz4/lz4.c``).

source: If ``LV_USE_STDLIB_MALLOC`` is set to ``LV_STDLIB_BUILTIN``, memory usage and memory leaks can be monitored.
it_it: Se ``LV_USE_STDLIB_MALLOC`` è impostato su ``LV_STDLIB_BUILTIN``, è possibile monitorare l'utilizzo della memoria e i "leak" [perdite] di memoria.

source: If ``NULL`` is passed for the ``format_string`` argument:
it_it: Se viene passato ``NULL`` per l'argomento ``format_string``:

source: If ``NULL`` is passed, all displays that have active refresh timers will be refreshed.
it_it: Se viene passato ``NULL``, tutti i display con timer di aggiornamento attivi verranno aggiornati.

source: If ``NULL`` is passed, the lowest inactivity time among all displays will be returned (in this case NULL does *not* mean the :ref:`default_display`).
it_it: Se viene passato ``NULL``, verrà restituito il tempo di inattività più basso tra tutti i display (in questo caso NULL *non* indica :ref:`default_display`).

source: If ``as_file`` is:
it_it: Se ``as_file`` è:

source: If ``display1`` is ``NULL``, the :ref:`default_display` will be used (**not all displays**).
it_it: Se ``display1`` è ``NULL``, verrà utilizzato :ref:`default_display` (**non tutti i display**).

source: If ``grad.dir`` is not ``LV_GRAD_DIR_NONE``, the ``color`` field is ignored.
it_it: Se ``grad.dir`` non è ``LV_GRAD_DIR_NONE``, il campo ``color`` viene ignorato.

source: If ``icon`` is not NULL, an image is created, centered on the button, using ``icon`` as its image source.
it_it: Se ``icon`` non è NULL, viene creata un'immagine, centrata sul pulsante, utilizzando ``icon`` come sorgente.

source: If ``keep_outside`` is set to 1, areas outside of ``area`` remain unchanged.
it_it: Se ``keep_outside`` è impostato su 1, le aree esterne ad ``area`` rimangono invariate.

source: If ``make`` or :ref:`build_cmake` handles the examples and demos directories, no extra action is required.
it_it: Se ``make`` o :ref:`build_cmake` gestiscono le directory ``examples`` e ``demos``, non è richiesta alcuna azione aggiuntiva.

source: If ``parent`` is ``NULL`` the message box will be modal, and will use the :ref:`default_display`'s Top :ref:`Layer <display_screen_layers>` as a parent.
it_it: Se ``parent`` è ``NULL``, la finestra di messaggio sarà modale e utilizzerà il :ref:`Layer <display_screen_layers>` del :ref:`default_display` come genitore.

source: If ``step`` is **negative**, the subject's value will be decremented.
it_it: Se ``step`` è **negativo**, il valore del soggetto verrà decrementato.

source: If ``style`` is ``NULL`` all Widgets will be notified about a style change.
it_it: Se ``style`` è ``NULL`` tutti i Widget riceveranno una notifica di modifica dello stile.

source: If ``target="self"``, the timeline is looked up in the current Component/widget/Screen (i.e. in the current XML file).
it_it: Se ``target="self"``, la timeline viene cercata nel Componente/widget/Screen corrente (ovvero nel file XML corrente).

source: If ``•`` does not exist in the font, ``*`` will be used.
it_it: Se ``•`` non è presente nel font, verrà utilizzato ``*``.

source: If `false` the given part will be blurred when it's rendered but before drawing the children.
it_it: Se `false`, la parte specificata verrà sfocata durante il rendering, ma prima di disegnare gli elementi figlio.

source: If `true` the background of the widget will be blurred.
it_it: Se `true`, lo sfondo del widget verrà sfocato.

source: If a Component is extended, the ``<api>`` properties can be used: ``<view extends="my_button" button_text="Apply">``.
it_it: Se un Componente viene esteso, è possibile utilizzare le proprietà ``<api>``: ``<view extends="my_button" button_text="Apply">``.

source: If a Draw Unit is busy with another Draw Task, it just returns.
it_it: Se una Draw Unit è impegnata con un altro Draw Task, ritorna semplicemente.

source: If a PART of a Scale is within the range of 2 or more Sections (i.e. those Sections overlap), the Style's properties belonging to the most recently added Section takes precedence over the same style properties of other Section(s) that "involve" that PART.
it_it: Se una PARTE di una Scala rientra nell'intervallo di 2 o più Sezioni (ovvero se tali Sezioni si sovrappongono), le proprietà dello Stile appartenenti alla Sezione aggiunta più di recente hanno la precedenza sulle stesse proprietà di stile delle altre Sezioni che "coinvolgono" quella PARTE.

source: If a Section's range is not within the Scale's range at all, it will not be used in drawing.
it_it: Se l'intervallo di una Sezione non rientra affatto nell'intervallo della "Scale", non verrà utilizzato nel disegno.

source: If a Table's width or height is set to :c:macro:`LV_SIZE_CONTENT` that size will be used to show the whole Table in the respective direction.
it_it: Se la larghezza o l'altezza di una Tabella è impostata su :c:macro:`LV_SIZE_CONTENT`, tale dimensione verrà utilizzata per visualizzare l'intera tabella nella rispettiva direzione.

source: If a Widget can't be scrolled further (e.g. its content has reached the bottom-most position), additional scrolling is propagated to its parent.
it_it: Se un widget non può essere ulteriormente scorrevole (ad esempio, perché il suo contenuto ha raggiunto la posizione più bassa), lo scorrimento aggiuntivo viene propagato al suo elemento padre.

source: If a Widget is extended, the component can use the Widget's API, e.g., ``<view extends="lv_slider" min_value="20">``.
it_it: Se un Widget viene esteso, il componente può utilizzare l'API del Widget, ad esempio ``<view extends="lv_slider" min_value="20">``.

source: If a button is pressed only the button's area will be redrawn.
it_it: Se si preme un pulsante, verrà ridisegnata solo l'area del pulsante.

source: If a button is pressed, it simulates a press at the assigned coordinate, similar to a touchpad.
it_it: Premendo un pulsante, si simula una pressione sulla coordinata assegnata, in modo simile a un touchpad.

source: If a child is partially or fully outside its parent, the parts outside will not be visible.
it_it: Se un elemento figlio è parzialmente o completamente esterno al suo elemento padre, le parti esterne non saranno visibili.

source: If a component needs to be extended with a feature or API that is not supported by the editor, the simplest solution is to create a wrapper component.
it_it: Se un componente deve essere esteso con una funzionalità o un'API non supportata dall'editor, la soluzione più semplice è creare un componente wrapper.

source: If a custom theme is created, a parent theme can be selected.
it_it: Se viene creato un tema personalizzato, è possibile selezionare un tema genitore.

source: If a font is used from C data (arrays) compiled into the firmware, the font's pointer can be registered to XML like this:
it_it: Se un font viene utilizzato da dati C (array) compilati nel firmware, il puntatore del font può essere registrato in XML in questo modo:

source: If a name ends with ``#``, LVGL will automatically replace it with an index based on the number of siblings with the same base name.
it_it: Se un nome termina con ``#``, LVGL lo sostituirà automaticamente con un indice basato sul numero di elementi simili con lo stesso nome di base.

source: If a property is not defined in a state the best matching state's property will be used.
it_it: Se una proprietà non è definita in uno stato, verrà utilizzata la proprietà dello stato che corrisponde meglio.

source: If a property is not set on a Widget instance, it is skipped and the Widget's built-in default is used.
it_it: Se una proprietà non è impostata su un'istanza del Widget, viene ignorata e viene utilizzato il valore di default nativo nel Widget.

source: If a screen is permanent, then when a new screen is loaded, the permanent screen is not deleted so that it keeps its state.
it_it: Se una schermata è permanente, quando ne viene caricata una nuova, quella permanente non viene eliminata, mantenendo così il suo stato.

source: If a specific LVGL version is required, specify this in your project to avoid automatic updates.
it_it: Se è richiesta una versione specifica di LVGL, la si deve specificare nel progetto per evitare aggiornamenti automatici.

source: If a style which is already assigned to a Widget changes (i.e. a property is added or changed), the Widgets using that style should be notified.
it_it: Se uno stile già assegnato a un widget cambia (ad esempio, viene aggiunta o modificata una proprietà), i Widget che utilizzano quello stile devono essere avvisati.

source: If a style will not need to be changed at runtime, styles can be created as ``const`` variables as well to save RAM:
it_it: Se non è necessario modificare uno stile in fase di runtime, gli stili possono essere creati anche come variabili "const" per risparmiare RAM:

source: If a tag exists but the translation for the selected language is missing the tag itself will be returned.
it_it: Se un tag esiste ma manca la traduzione per la lingua selezionata, verrà restituito il tag stesso.

source: If a widget in that group has focus, it will return a pointer to it; otherwise, it will return NULL.
it_it: Se un widget in quel gruppo ha il focus, restituirà un puntatore ad esso; altrimenti, restituirà NULL.

source: If a widget or screen is no longer needed, it can be removed by calling :cpp:expr:`lv_obj_delete(my_button1)`
it_it: Se un widget o una schermata non sono più necessari, possono essere rimossi chiamando :cpp:expr:`lv_obj_delete(my_button1)`

source: If a widget switches to edit mode, it enters the :cpp:expr:`LV_STATE_FOCUSED | LV_STATE_EDITED` states, so any style properties assigned to these states will be shown.
it_it: Se un widget passa in "edit mode", entra negli stati :cpp:expr:`LV_STATE_FOCUSED | LV_STATE_EDITED`, quindi verranno visualizzate tutte le proprietà di stile assegnate a questi stati.

source: If all works well, a '\ |check|\ ' character should be displayed.
it_it: Se tutto funzionasse correttamente, dovrebbe essere visualizzato un carattere '\ |check|\ '.

source: If an HDMI display is connected, the kernel detects it and allocates a portion of RAM as the framebuffer, which holds the pixel data for rendering images.
it_it: Se è collegato un display HDMI, il kernel lo rileva e alloca una porzione di RAM come framebuffer, che contiene i dati pixel per il rendering delle immagini.

source: If an encoder is used as input device, the selected digit is shifted to the right by default whenever the encoder button is clicked.
it_it: Se si utilizza un encoder come dispositivo di input, la cifra selezionata viene spostata a destra per default ogni volta che si clicca sul pulsante dell'encoder.

source: If an external link will be used on many pages:
it_it: Se un link esterno verrà utilizzato su più pagine:

source: If an image sources have been set for other states, e.g. :cpp:enumerator:`LV_IMAGEBUTTON_STATE_PRESSED`, they will be used instead when the Image Button is in that state.
it_it: Se sono state impostate sorgenti immagine per altri stati, ad esempio :cpp:enumerator:`LV_IMAGEBUTTON_STATE_PRESSED`, queste verranno utilizzate al loro posto quando l'Image Button si trova in quello stato.

source: If an incompatible parameter is passed, the program may fail.
it_it: Se viene passato un parametro incompatibile, il programma potrebbe non funzionare.

source: If an interrupt MUST convey information to part of your application that calls LVGL functions, set a flag or other atomic value that your LVGL-calling thread (or an :ref:`LVGL Timer <timer>` you create) can read from and take action.
it_it: Se un interrupt DEVE trasmettere informazioni a una parte dell'applicazione che chiama funzioni LVGL, imposta un flag o un altro valore atomico che il thread che chiama LVGL (o un :ref:`Timer LVGL <timer>` che si crea) possa leggere ed eseguire azioni.
